; ModuleID = 'ComputeList.C'
source_filename = "ComputeList.C"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


%class.ComputeList = type { i32, i32, %class.SelfCompute*, %class.PairCompute* }
%class.SelfCompute = type { i32, %class.Pairlists, i32, double }
%class.Pairlists = type { i16*, i32, i32 }
%class.PairCompute = type { i32, i32, i32, i32, %class.Pairlists, i32, double }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%class.PatchList = type { i32, i32, i32, i32, i32, %class.Patch*, %class.Lattice*, double* }
%class.Patch = type <{ i32, [4 x i8], %struct.CompAtom*, %struct.CompAtomExt*, %class.Vector*, %class.Vector*, %class.Vector*, i32, [4 x i8] }>
%struct.CompAtom = type { %class.Vector, float, i16, i8, i8 }
%class.Vector = type { double, double, double }
%struct.CompAtomExt = type { i32 }
%class.Lattice = type opaque

@.str = private unnamed_addr constant [19 x i8] c"COMPUTEPAIR_BEGIN\0A\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.4 = private unnamed_addr constant [13 x i8] c"%d %d %d %d\0A\00", align 1
@.str.6 = private unnamed_addr constant [17 x i8] c"COMPUTEPAIR_END\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 4.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "ComputeList.C", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 37, size: 32, elements: !53, identifier: "_ZTSN9PairlistsUt_E")
!4 = !DIFile(filename: "./ComputeNonbondedUtil.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!5 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Pairlists", file: !4, line: 36, size: 128, elements: !6, identifier: "_ZTS9Pairlists")
!6 = !{!7, !11, !13, !14, !20, !24, !27, !28, !31, !34, !37, !38, !43, !46, !47, !50}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !5, file: !4, line: 38, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "plint", file: !4, line: 34, baseType: !10)
!10 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !5, file: !4, line: 39, baseType: !12, size: 32, offset: 64)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !5, file: !4, line: 40, baseType: !12, size: 32, offset: 96)
!14 = !DISubprogram(name: "Pairlists", scope: !5, file: !4, line: 41, type: !15, isLocal: false, isDefinition: false, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !18}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!18 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!20 = !DISubprogram(name: "operator=", linkageName: "_ZN9PairlistsaSERKS_", scope: !5, file: !4, line: 42, type: !21, isLocal: false, isDefinition: false, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !17, !18}
!23 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !5, size: 64)
!24 = !DISubprogram(name: "Pairlists", scope: !5, file: !4, line: 44, type: !25, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !17}
!27 = !DISubprogram(name: "~Pairlists", scope: !5, file: !4, line: 45, type: !25, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!28 = !DISubprogram(name: "newlist", linkageName: "_ZN9Pairlists7newlistEi", scope: !5, file: !4, line: 46, type: !29, isLocal: false, isDefinition: false, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!29 = !DISubroutineType(types: !30)
!30 = !{!8, !17, !12}
!31 = !DISubprogram(name: "newlist", linkageName: "_ZN9Pairlists7newlistEv", scope: !5, file: !4, line: 61, type: !32, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!32 = !DISubroutineType(types: !33)
!33 = !{!8, !17}
!34 = !DISubprogram(name: "newsize", linkageName: "_ZN9Pairlists7newsizeEi", scope: !5, file: !4, line: 65, type: !35, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !17, !12}
!37 = !DISubprogram(name: "reset", linkageName: "_ZN9Pairlists5resetEv", scope: !5, file: !4, line: 69, type: !25, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!38 = !DISubprogram(name: "nextlist", linkageName: "_ZN9Pairlists8nextlistEPPtPi", scope: !5, file: !4, line: 70, type: !39, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !17, !41, !42}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!43 = !DISubprogram(name: "getSize", linkageName: "_ZN9Pairlists7getSizeEv", scope: !5, file: !4, line: 74, type: !44, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!44 = !DISubroutineType(types: !45)
!45 = !{!12, !17}
!46 = !DISubprogram(name: "addIndex", linkageName: "_ZN9Pairlists8addIndexEv", scope: !5, file: !4, line: 76, type: !25, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!47 = !DISubprogram(name: "setIndexValue", linkageName: "_ZN9Pairlists13setIndexValueEt", scope: !5, file: !4, line: 79, type: !48, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !17, !9}
!50 = !DISubprogram(name: "getIndexValue", linkageName: "_ZN9Pairlists13getIndexValueEv", scope: !5, file: !4, line: 83, type: !51, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!51 = !DISubroutineType(types: !52)
!52 = !{!9, !17}
!53 = !{!54}
!54 = !DIEnumerator(name: "initsize", value: 10)
!55 = !{i32 2, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{!"clang version 4.0.1 "}
!58 = distinct !DISubprogram(name: "ComputeList", linkageName: "_ZN11ComputeListC2Ev", scope: !59, file: !1, line: 11, type: !418, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, unit: !0, declaration: !417, variables: !428)
!59 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ComputeList", file: !60, line: 16, size: 192, elements: !61, identifier: "_ZTS11ComputeList")
!60 = !DIFile(filename: "./ComputeList.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!61 = !{!62, !63, !64, !397, !417, !421, !422, !425}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "numSelfComputes", scope: !59, file: !60, line: 19, baseType: !12, size: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "numPairComputes", scope: !59, file: !60, line: 20, baseType: !12, size: 32, offset: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "selfComputes", scope: !59, file: !60, line: 22, baseType: !65, size: 64, offset: 64, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SelfCompute", file: !67, line: 14, size: 320, elements: !68, identifier: "_ZTS11SelfCompute")
!67 = !DIFile(filename: "./Compute.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!68 = !{!69, !293, !294, !295, !296, !297, !301, !302}
!69 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !66, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ComputeNonbondedUtil", file: !4, line: 214, size: 8, elements: !71, identifier: "_ZTS20ComputeNonbondedUtil")
!71 = !{!72, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !97, !100, !101, !102, !103, !104, !108, !113, !114, !115, !116, !117, !118, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !180, !181, !188, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "calcPair", scope: !70, file: !4, line: 223, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "nonbonded", file: !4, line: 171, flags: DIFlagFwdDecl, identifier: "_ZTS9nonbonded")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "calcPairEnergy", scope: !70, file: !4, line: 224, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "calcSelf", scope: !70, file: !4, line: 225, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "calcSelfEnergy", scope: !70, file: !4, line: 226, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullPair", scope: !70, file: !4, line: 228, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullPairEnergy", scope: !70, file: !4, line: 229, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullSelf", scope: !70, file: !4, line: 230, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullSelfEnergy", scope: !70, file: !4, line: 231, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergePair", scope: !70, file: !4, line: 233, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergePairEnergy", scope: !70, file: !4, line: 234, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergeSelf", scope: !70, file: !4, line: 235, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergeSelfEnergy", scope: !70, file: !4, line: 236, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowPair", scope: !70, file: !4, line: 238, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowPairEnergy", scope: !70, file: !4, line: 239, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowSelf", scope: !70, file: !4, line: 240, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowSelfEnergy", scope: !70, file: !4, line: 241, baseType: !73, flags: DIFlagPublic | DIFlagStaticMember)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "commOnly", scope: !70, file: !4, line: 258, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !95, line: 83, baseType: !12)
!95 = !DIFile(filename: "./common.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fixedAtomsOn", scope: !70, file: !4, line: 259, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !70, file: !4, line: 260, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "BigReal", file: !95, line: 65, baseType: !99)
!99 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff2", scope: !70, file: !4, line: 261, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pairlistdist", scope: !70, file: !4, line: 262, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hgroupcutoff", scope: !70, file: !4, line: 263, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dielectric_1", scope: !70, file: !4, line: 264, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ljTable", scope: !70, file: !4, line: 265, baseType: !105, flags: DIFlagPublic | DIFlagStaticMember)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "LJTable", file: !4, line: 18, flags: DIFlagFwdDecl, identifier: "_ZTS7LJTable")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mol", scope: !70, file: !4, line: 266, baseType: !109, flags: DIFlagPublic | DIFlagStaticMember)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_class_type, name: "Molecule", file: !112, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTS8Molecule")
!112 = !DIFile(filename: "./Molecule.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "r2_delta", scope: !70, file: !4, line: 267, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "r2_delta_1", scope: !70, file: !4, line: 267, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rowsize", scope: !70, file: !4, line: 268, baseType: !12, flags: DIFlagPublic | DIFlagStaticMember)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "columnsize", scope: !70, file: !4, line: 269, baseType: !12, flags: DIFlagPublic | DIFlagStaticMember)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "r2_delta_exp", scope: !70, file: !4, line: 270, baseType: !12, flags: DIFlagPublic | DIFlagStaticMember)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "table_alloc", scope: !70, file: !4, line: 271, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "table_ener", scope: !70, file: !4, line: 272, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "table_short", scope: !70, file: !4, line: 273, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "table_noshort", scope: !70, file: !4, line: 274, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fast_table", scope: !70, file: !4, line: 275, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "scor_table", scope: !70, file: !4, line: 276, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "slow_table", scope: !70, file: !4, line: 277, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "corr_table", scope: !70, file: !4, line: 278, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "full_table", scope: !70, file: !4, line: 279, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vdwa_table", scope: !70, file: !4, line: 280, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vdwb_table", scope: !70, file: !4, line: 281, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "r2_table", scope: !70, file: !4, line: 282, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !70, file: !4, line: 283, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "scale14", scope: !70, file: !4, line: 284, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "switchOn", scope: !70, file: !4, line: 285, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "switchOn_1", scope: !70, file: !4, line: 286, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "switchOn2", scope: !70, file: !4, line: 287, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v_vdwa", scope: !70, file: !4, line: 288, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "v_vdwb", scope: !70, file: !4, line: 289, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "k_vdwa", scope: !70, file: !4, line: 290, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "k_vdwb", scope: !70, file: !4, line: 291, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_3", scope: !70, file: !4, line: 292, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_6", scope: !70, file: !4, line: 293, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "c0", scope: !70, file: !4, line: 294, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !70, file: !4, line: 295, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "c3", scope: !70, file: !4, line: 296, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "c5", scope: !70, file: !4, line: 297, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !70, file: !4, line: 298, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "c7", scope: !70, file: !4, line: 299, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "c8", scope: !70, file: !4, line: 300, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "alchFepOn", scope: !70, file: !4, line: 303, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "alchThermIntOn", scope: !70, file: !4, line: 304, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "alchLambda", scope: !70, file: !4, line: 305, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "alchLambda2", scope: !70, file: !4, line: 306, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alchVdwShiftCoeff", scope: !70, file: !4, line: 307, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "alchElecLambdaStart", scope: !70, file: !4, line: 308, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "alchVdwLambdaEnd", scope: !70, file: !4, line: 309, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Fep_WCA_repuOn", scope: !70, file: !4, line: 310, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Fep_WCA_dispOn", scope: !70, file: !4, line: 311, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "WCA_rcut1", scope: !70, file: !4, line: 312, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "WCA_rcut2", scope: !70, file: !4, line: 313, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "alchDecouple", scope: !70, file: !4, line: 314, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "lesOn", scope: !70, file: !4, line: 316, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "lesFactor", scope: !70, file: !4, line: 317, baseType: !12, flags: DIFlagPublic | DIFlagStaticMember)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "lesScaling", scope: !70, file: !4, line: 318, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lambda_table", scope: !70, file: !4, line: 320, baseType: !119, flags: DIFlagPublic | DIFlagStaticMember)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionOn", scope: !70, file: !4, line: 322, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionSelf", scope: !70, file: !4, line: 323, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileOn", scope: !70, file: !4, line: 325, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileSlabs", scope: !70, file: !4, line: 326, baseType: !12, flags: DIFlagPublic | DIFlagStaticMember)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileAtomTypes", scope: !70, file: !4, line: 327, baseType: !12, flags: DIFlagPublic | DIFlagStaticMember)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileThickness", scope: !70, file: !4, line: 328, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileMin", scope: !70, file: !4, line: 329, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "accelMDOn", scope: !70, file: !4, line: 331, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "drudeNbthole", scope: !70, file: !4, line: 333, baseType: !94, flags: DIFlagPublic | DIFlagStaticMember)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcof", scope: !70, file: !4, line: 336, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pi_ewaldcof", scope: !70, file: !4, line: 337, baseType: !98, flags: DIFlagPublic | DIFlagStaticMember)
!176 = !DISubprogram(name: "ComputeNonbondedUtil", scope: !70, file: !4, line: 218, type: !177, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!180 = !DISubprogram(name: "~ComputeNonbondedUtil", scope: !70, file: !4, line: 219, type: !177, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubprogram(name: "select", linkageName: "_ZN20ComputeNonbondedUtil6selectEP13SimParametersP8MoleculeP7LJTable", scope: !70, file: !4, line: 220, type: !182, isLocal: false, isDefinition: false, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_class_type, name: "SimParameters", file: !4, line: 20, flags: DIFlagFwdDecl, identifier: "_ZTS13SimParameters")
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!188 = !DISubprogram(name: "square", linkageName: "_ZN20ComputeNonbondedUtil6squareERKdS1_S1_", scope: !70, file: !4, line: 340, type: !189, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{!98, !191, !191, !191}
!191 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!193 = !DISubprogram(name: "calc_error", linkageName: "_ZN20ComputeNonbondedUtil10calc_errorEP9nonbonded", scope: !70, file: !4, line: 347, type: !74, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubprogram(name: "calc_pair", linkageName: "_ZN20ComputeNonbondedUtil9calc_pairEP9nonbonded", scope: !70, file: !4, line: 349, type: !74, isLocal: false, isDefinition: false, scopeLine: 349, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!195 = !DISubprogram(name: "calc_pair_energy", linkageName: "_ZN20ComputeNonbondedUtil16calc_pair_energyEP9nonbonded", scope: !70, file: !4, line: 350, type: !74, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubprogram(name: "calc_pair_fullelect", linkageName: "_ZN20ComputeNonbondedUtil19calc_pair_fullelectEP9nonbonded", scope: !70, file: !4, line: 351, type: !74, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!197 = !DISubprogram(name: "calc_pair_energy_fullelect", linkageName: "_ZN20ComputeNonbondedUtil26calc_pair_energy_fullelectEP9nonbonded", scope: !70, file: !4, line: 352, type: !74, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!198 = !DISubprogram(name: "calc_pair_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil25calc_pair_merge_fullelectEP9nonbonded", scope: !70, file: !4, line: 353, type: !74, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubprogram(name: "calc_pair_energy_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil32calc_pair_energy_merge_fullelectEP9nonbonded", scope: !70, file: !4, line: 354, type: !74, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubprogram(name: "calc_pair_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil24calc_pair_slow_fullelectEP9nonbonded", scope: !70, file: !4, line: 355, type: !74, isLocal: false, isDefinition: false, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!201 = !DISubprogram(name: "calc_pair_energy_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil31calc_pair_energy_slow_fullelectEP9nonbonded", scope: !70, file: !4, line: 356, type: !74, isLocal: false, isDefinition: false, scopeLine: 356, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!202 = !DISubprogram(name: "calc_self", linkageName: "_ZN20ComputeNonbondedUtil9calc_selfEP9nonbonded", scope: !70, file: !4, line: 358, type: !74, isLocal: false, isDefinition: false, scopeLine: 358, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubprogram(name: "calc_self_energy", linkageName: "_ZN20ComputeNonbondedUtil16calc_self_energyEP9nonbonded", scope: !70, file: !4, line: 359, type: !74, isLocal: false, isDefinition: false, scopeLine: 359, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!204 = !DISubprogram(name: "calc_self_fullelect", linkageName: "_ZN20ComputeNonbondedUtil19calc_self_fullelectEP9nonbonded", scope: !70, file: !4, line: 360, type: !74, isLocal: false, isDefinition: false, scopeLine: 360, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubprogram(name: "calc_self_energy_fullelect", linkageName: "_ZN20ComputeNonbondedUtil26calc_self_energy_fullelectEP9nonbonded", scope: !70, file: !4, line: 361, type: !74, isLocal: false, isDefinition: false, scopeLine: 361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubprogram(name: "calc_self_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil25calc_self_merge_fullelectEP9nonbonded", scope: !70, file: !4, line: 362, type: !74, isLocal: false, isDefinition: false, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubprogram(name: "calc_self_energy_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil32calc_self_energy_merge_fullelectEP9nonbonded", scope: !70, file: !4, line: 363, type: !74, isLocal: false, isDefinition: false, scopeLine: 363, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!208 = !DISubprogram(name: "calc_self_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil24calc_self_slow_fullelectEP9nonbonded", scope: !70, file: !4, line: 364, type: !74, isLocal: false, isDefinition: false, scopeLine: 364, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubprogram(name: "calc_self_energy_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil31calc_self_energy_slow_fullelectEP9nonbonded", scope: !70, file: !4, line: 365, type: !74, isLocal: false, isDefinition: false, scopeLine: 365, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubprogram(name: "calc_pair_energy_fep", linkageName: "_ZN20ComputeNonbondedUtil20calc_pair_energy_fepEP9nonbonded", scope: !70, file: !4, line: 368, type: !74, isLocal: false, isDefinition: false, scopeLine: 368, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubprogram(name: "calc_pair_energy_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_energy_fullelect_fepEP9nonbonded", scope: !70, file: !4, line: 369, type: !74, isLocal: false, isDefinition: false, scopeLine: 369, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil36calc_pair_energy_merge_fullelect_fepEP9nonbonded", scope: !70, file: !4, line: 370, type: !74, isLocal: false, isDefinition: false, scopeLine: 370, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil35calc_pair_energy_slow_fullelect_fepEP9nonbonded", scope: !70, file: !4, line: 371, type: !74, isLocal: false, isDefinition: false, scopeLine: 371, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubprogram(name: "calc_self_energy_fep", linkageName: "_ZN20ComputeNonbondedUtil20calc_self_energy_fepEP9nonbonded", scope: !70, file: !4, line: 372, type: !74, isLocal: false, isDefinition: false, scopeLine: 372, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubprogram(name: "calc_self_energy_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_energy_fullelect_fepEP9nonbonded", scope: !70, file: !4, line: 373, type: !74, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubprogram(name: "calc_self_energy_merge_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil36calc_self_energy_merge_fullelect_fepEP9nonbonded", scope: !70, file: !4, line: 374, type: !74, isLocal: false, isDefinition: false, scopeLine: 374, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!217 = !DISubprogram(name: "calc_self_energy_slow_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil35calc_self_energy_slow_fullelect_fepEP9nonbonded", scope: !70, file: !4, line: 375, type: !74, isLocal: false, isDefinition: false, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubprogram(name: "calc_pair_energy_ti", linkageName: "_ZN20ComputeNonbondedUtil19calc_pair_energy_tiEP9nonbonded", scope: !70, file: !4, line: 377, type: !74, isLocal: false, isDefinition: false, scopeLine: 377, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubprogram(name: "calc_pair_ti", linkageName: "_ZN20ComputeNonbondedUtil12calc_pair_tiEP9nonbonded", scope: !70, file: !4, line: 378, type: !74, isLocal: false, isDefinition: false, scopeLine: 378, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!220 = !DISubprogram(name: "calc_pair_energy_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil29calc_pair_energy_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 379, type: !74, isLocal: false, isDefinition: false, scopeLine: 379, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!221 = !DISubprogram(name: "calc_pair_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil22calc_pair_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 380, type: !74, isLocal: false, isDefinition: false, scopeLine: 380, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!222 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil35calc_pair_energy_merge_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 381, type: !74, isLocal: false, isDefinition: false, scopeLine: 381, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!223 = !DISubprogram(name: "calc_pair_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil28calc_pair_merge_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 382, type: !74, isLocal: false, isDefinition: false, scopeLine: 382, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil34calc_pair_energy_slow_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 383, type: !74, isLocal: false, isDefinition: false, scopeLine: 383, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!225 = !DISubprogram(name: "calc_pair_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil27calc_pair_slow_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 384, type: !74, isLocal: false, isDefinition: false, scopeLine: 384, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!226 = !DISubprogram(name: "calc_self_energy_ti", linkageName: "_ZN20ComputeNonbondedUtil19calc_self_energy_tiEP9nonbonded", scope: !70, file: !4, line: 385, type: !74, isLocal: false, isDefinition: false, scopeLine: 385, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!227 = !DISubprogram(name: "calc_self_ti", linkageName: "_ZN20ComputeNonbondedUtil12calc_self_tiEP9nonbonded", scope: !70, file: !4, line: 386, type: !74, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!228 = !DISubprogram(name: "calc_self_energy_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil29calc_self_energy_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 387, type: !74, isLocal: false, isDefinition: false, scopeLine: 387, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubprogram(name: "calc_self_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil22calc_self_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 388, type: !74, isLocal: false, isDefinition: false, scopeLine: 388, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubprogram(name: "calc_self_energy_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil35calc_self_energy_merge_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 389, type: !74, isLocal: false, isDefinition: false, scopeLine: 389, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubprogram(name: "calc_self_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil28calc_self_merge_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 390, type: !74, isLocal: false, isDefinition: false, scopeLine: 390, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!232 = !DISubprogram(name: "calc_self_energy_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil34calc_self_energy_slow_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 391, type: !74, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubprogram(name: "calc_self_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil27calc_self_slow_fullelect_tiEP9nonbonded", scope: !70, file: !4, line: 392, type: !74, isLocal: false, isDefinition: false, scopeLine: 392, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubprogram(name: "calc_pair_les", linkageName: "_ZN20ComputeNonbondedUtil13calc_pair_lesEP9nonbonded", scope: !70, file: !4, line: 395, type: !74, isLocal: false, isDefinition: false, scopeLine: 395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubprogram(name: "calc_pair_energy_les", linkageName: "_ZN20ComputeNonbondedUtil20calc_pair_energy_lesEP9nonbonded", scope: !70, file: !4, line: 396, type: !74, isLocal: false, isDefinition: false, scopeLine: 396, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!236 = !DISubprogram(name: "calc_pair_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil23calc_pair_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 397, type: !74, isLocal: false, isDefinition: false, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!237 = !DISubprogram(name: "calc_pair_energy_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_energy_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 398, type: !74, isLocal: false, isDefinition: false, scopeLine: 398, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubprogram(name: "calc_pair_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil29calc_pair_merge_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 399, type: !74, isLocal: false, isDefinition: false, scopeLine: 399, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil36calc_pair_energy_merge_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 400, type: !74, isLocal: false, isDefinition: false, scopeLine: 400, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!240 = !DISubprogram(name: "calc_pair_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil28calc_pair_slow_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 401, type: !74, isLocal: false, isDefinition: false, scopeLine: 401, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!241 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil35calc_pair_energy_slow_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 402, type: !74, isLocal: false, isDefinition: false, scopeLine: 402, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubprogram(name: "calc_self_les", linkageName: "_ZN20ComputeNonbondedUtil13calc_self_lesEP9nonbonded", scope: !70, file: !4, line: 403, type: !74, isLocal: false, isDefinition: false, scopeLine: 403, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubprogram(name: "calc_self_energy_les", linkageName: "_ZN20ComputeNonbondedUtil20calc_self_energy_lesEP9nonbonded", scope: !70, file: !4, line: 404, type: !74, isLocal: false, isDefinition: false, scopeLine: 404, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!244 = !DISubprogram(name: "calc_self_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil23calc_self_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 405, type: !74, isLocal: false, isDefinition: false, scopeLine: 405, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!245 = !DISubprogram(name: "calc_self_energy_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_energy_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 406, type: !74, isLocal: false, isDefinition: false, scopeLine: 406, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubprogram(name: "calc_self_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil29calc_self_merge_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 407, type: !74, isLocal: false, isDefinition: false, scopeLine: 407, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubprogram(name: "calc_self_energy_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil36calc_self_energy_merge_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 408, type: !74, isLocal: false, isDefinition: false, scopeLine: 408, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!248 = !DISubprogram(name: "calc_self_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil28calc_self_slow_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 409, type: !74, isLocal: false, isDefinition: false, scopeLine: 409, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!249 = !DISubprogram(name: "calc_self_energy_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil35calc_self_energy_slow_fullelect_lesEP9nonbonded", scope: !70, file: !4, line: 410, type: !74, isLocal: false, isDefinition: false, scopeLine: 410, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!250 = !DISubprogram(name: "calc_pair_energy_int", linkageName: "_ZN20ComputeNonbondedUtil20calc_pair_energy_intEP9nonbonded", scope: !70, file: !4, line: 413, type: !74, isLocal: false, isDefinition: false, scopeLine: 413, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubprogram(name: "calc_pair_energy_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_energy_fullelect_intEP9nonbonded", scope: !70, file: !4, line: 414, type: !74, isLocal: false, isDefinition: false, scopeLine: 414, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!252 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil36calc_pair_energy_merge_fullelect_intEP9nonbonded", scope: !70, file: !4, line: 415, type: !74, isLocal: false, isDefinition: false, scopeLine: 415, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!253 = !DISubprogram(name: "calc_self_energy_int", linkageName: "_ZN20ComputeNonbondedUtil20calc_self_energy_intEP9nonbonded", scope: !70, file: !4, line: 416, type: !74, isLocal: false, isDefinition: false, scopeLine: 416, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubprogram(name: "calc_self_energy_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_energy_fullelect_intEP9nonbonded", scope: !70, file: !4, line: 417, type: !74, isLocal: false, isDefinition: false, scopeLine: 417, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubprogram(name: "calc_self_energy_merge_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil36calc_self_energy_merge_fullelect_intEP9nonbonded", scope: !70, file: !4, line: 418, type: !74, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!256 = !DISubprogram(name: "calc_pair_pprof", linkageName: "_ZN20ComputeNonbondedUtil15calc_pair_pprofEP9nonbonded", scope: !70, file: !4, line: 421, type: !74, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!257 = !DISubprogram(name: "calc_pair_energy_pprof", linkageName: "_ZN20ComputeNonbondedUtil22calc_pair_energy_pprofEP9nonbonded", scope: !70, file: !4, line: 422, type: !74, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubprogram(name: "calc_pair_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil25calc_pair_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 423, type: !74, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubprogram(name: "calc_pair_energy_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil32calc_pair_energy_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 424, type: !74, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DISubprogram(name: "calc_pair_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil31calc_pair_merge_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 425, type: !74, isLocal: false, isDefinition: false, scopeLine: 425, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!261 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil38calc_pair_energy_merge_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 426, type: !74, isLocal: false, isDefinition: false, scopeLine: 426, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!262 = !DISubprogram(name: "calc_pair_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_slow_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 427, type: !74, isLocal: false, isDefinition: false, scopeLine: 427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil37calc_pair_energy_slow_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 428, type: !74, isLocal: false, isDefinition: false, scopeLine: 428, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubprogram(name: "calc_self_pprof", linkageName: "_ZN20ComputeNonbondedUtil15calc_self_pprofEP9nonbonded", scope: !70, file: !4, line: 429, type: !74, isLocal: false, isDefinition: false, scopeLine: 429, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubprogram(name: "calc_self_energy_pprof", linkageName: "_ZN20ComputeNonbondedUtil22calc_self_energy_pprofEP9nonbonded", scope: !70, file: !4, line: 430, type: !74, isLocal: false, isDefinition: false, scopeLine: 430, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!266 = !DISubprogram(name: "calc_self_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil25calc_self_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 431, type: !74, isLocal: false, isDefinition: false, scopeLine: 431, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubprogram(name: "calc_self_energy_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil32calc_self_energy_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 432, type: !74, isLocal: false, isDefinition: false, scopeLine: 432, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubprogram(name: "calc_self_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil31calc_self_merge_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 433, type: !74, isLocal: false, isDefinition: false, scopeLine: 433, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!269 = !DISubprogram(name: "calc_self_energy_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil38calc_self_energy_merge_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 434, type: !74, isLocal: false, isDefinition: false, scopeLine: 434, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubprogram(name: "calc_self_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_slow_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 435, type: !74, isLocal: false, isDefinition: false, scopeLine: 435, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubprogram(name: "calc_self_energy_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil37calc_self_energy_slow_fullelect_pprofEP9nonbonded", scope: !70, file: !4, line: 436, type: !74, isLocal: false, isDefinition: false, scopeLine: 436, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubprogram(name: "calc_pair_tabener", linkageName: "_ZN20ComputeNonbondedUtil17calc_pair_tabenerEP9nonbonded", scope: !70, file: !4, line: 439, type: !74, isLocal: false, isDefinition: false, scopeLine: 439, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!273 = !DISubprogram(name: "calc_pair_energy_tabener", linkageName: "_ZN20ComputeNonbondedUtil24calc_pair_energy_tabenerEP9nonbonded", scope: !70, file: !4, line: 440, type: !74, isLocal: false, isDefinition: false, scopeLine: 440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubprogram(name: "calc_pair_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil27calc_pair_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 441, type: !74, isLocal: false, isDefinition: false, scopeLine: 441, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!275 = !DISubprogram(name: "calc_pair_energy_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil34calc_pair_energy_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 442, type: !74, isLocal: false, isDefinition: false, scopeLine: 442, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!276 = !DISubprogram(name: "calc_pair_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil33calc_pair_merge_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 443, type: !74, isLocal: false, isDefinition: false, scopeLine: 443, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil40calc_pair_energy_merge_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 444, type: !74, isLocal: false, isDefinition: false, scopeLine: 444, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubprogram(name: "calc_pair_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil32calc_pair_slow_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 445, type: !74, isLocal: false, isDefinition: false, scopeLine: 445, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!279 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil39calc_pair_energy_slow_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 446, type: !74, isLocal: false, isDefinition: false, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubprogram(name: "calc_self_tabener", linkageName: "_ZN20ComputeNonbondedUtil17calc_self_tabenerEP9nonbonded", scope: !70, file: !4, line: 447, type: !74, isLocal: false, isDefinition: false, scopeLine: 447, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubprogram(name: "calc_self_energy_tabener", linkageName: "_ZN20ComputeNonbondedUtil24calc_self_energy_tabenerEP9nonbonded", scope: !70, file: !4, line: 448, type: !74, isLocal: false, isDefinition: false, scopeLine: 448, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!282 = !DISubprogram(name: "calc_self_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil27calc_self_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 449, type: !74, isLocal: false, isDefinition: false, scopeLine: 449, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!283 = !DISubprogram(name: "calc_self_energy_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil34calc_self_energy_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 450, type: !74, isLocal: false, isDefinition: false, scopeLine: 450, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubprogram(name: "calc_self_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil33calc_self_merge_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 451, type: !74, isLocal: false, isDefinition: false, scopeLine: 451, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!285 = !DISubprogram(name: "calc_self_energy_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil40calc_self_energy_merge_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 452, type: !74, isLocal: false, isDefinition: false, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!286 = !DISubprogram(name: "calc_self_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil32calc_self_slow_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 453, type: !74, isLocal: false, isDefinition: false, scopeLine: 453, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubprogram(name: "calc_self_energy_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil39calc_self_energy_slow_fullelect_tabenerEP9nonbonded", scope: !70, file: !4, line: 454, type: !74, isLocal: false, isDefinition: false, scopeLine: 454, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!288 = !DISubprogram(name: "calcGBIS", linkageName: "_ZN20ComputeNonbondedUtil8calcGBISEP9nonbondedP15GBISParamStruct", scope: !70, file: !4, line: 456, type: !289, isLocal: false, isDefinition: false, scopeLine: 456, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !179, !76, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "GBISParamStruct", file: !4, line: 138, flags: DIFlagFwdDecl, identifier: "_ZTS15GBISParamStruct")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "patchId", scope: !66, file: !67, line: 20, baseType: !12, size: 32, flags: DIFlagPublic)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pairlists", scope: !66, file: !67, line: 22, baseType: !5, size: 128, offset: 64, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pairlistsValid", scope: !66, file: !67, line: 23, baseType: !12, size: 32, offset: 192, flags: DIFlagPublic)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pairlistTolerance", scope: !66, file: !67, line: 24, baseType: !98, size: 64, offset: 256, flags: DIFlagPublic)
!297 = !DISubprogram(name: "SelfCompute", scope: !66, file: !67, line: 17, type: !298, isLocal: false, isDefinition: false, scopeLine: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!301 = !DISubprogram(name: "~SelfCompute", scope: !66, file: !67, line: 18, type: !298, isLocal: false, isDefinition: false, scopeLine: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!302 = !DISubprogram(name: "doWork", linkageName: "_ZN11SelfCompute6doWorkEP9PatchList", scope: !66, file: !67, line: 26, type: !303, isLocal: false, isDefinition: false, scopeLine: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !300, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PatchList", file: !307, line: 16, size: 384, elements: !308, identifier: "_ZTS9PatchList")
!307 = !DIFile(filename: "./PatchList.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!308 = !{!309, !310, !311, !312, !313, !314, !318, !321, !323, !327, !330, !390, !391, !392}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "doEnergy", scope: !306, file: !307, line: 19, baseType: !12, size: 32, flags: DIFlagPublic)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "doFull", scope: !306, file: !307, line: 20, baseType: !12, size: 32, offset: 32, flags: DIFlagPublic)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doMerge", scope: !306, file: !307, line: 21, baseType: !12, size: 32, offset: 64, flags: DIFlagPublic)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "savePairlists", scope: !306, file: !307, line: 22, baseType: !12, size: 32, offset: 96, flags: DIFlagPublic)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "numPatches", scope: !306, file: !307, line: 24, baseType: !12, size: 32, offset: 128, flags: DIFlagPublic)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "patches", scope: !306, file: !307, line: 26, baseType: !315, size: 64, offset: 192, flags: DIFlagPublic)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_class_type, name: "Patch", file: !317, line: 16, flags: DIFlagFwdDecl, identifier: "_ZTS5Patch")
!317 = !DIFile(filename: "./Patch.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "lattice", scope: !306, file: !307, line: 33, baseType: !319, size: 64, offset: 256, flags: DIFlagPublic)
!319 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_class_type, name: "Lattice", file: !317, line: 14, flags: DIFlagFwdDecl, identifier: "_ZTS7Lattice")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reductionData", scope: !306, file: !307, line: 39, baseType: !322, size: 64, offset: 320, flags: DIFlagPublic)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!323 = !DISubprogram(name: "PatchList", scope: !306, file: !307, line: 28, type: !324, isLocal: false, isDefinition: false, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !326, !319}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!327 = !DISubprogram(name: "~PatchList", scope: !306, file: !307, line: 29, type: !328, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !326}
!330 = !DISubprogram(name: "readfile", linkageName: "_ZN9PatchList8readfileEP8_IO_FILEP8Molecule", scope: !306, file: !307, line: 31, type: !331, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!12, !326, !333, !186}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !335, line: 48, baseType: !336)
!335 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !337, line: 246, size: 1728, elements: !338, identifier: "_ZTS8_IO_FILE")
!337 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!338 = !{!339, !340, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !356, !358, !359, !360, !364, !365, !367, !371, !374, !376, !378, !379, !380, !381, !385, !386}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !336, file: !337, line: 247, baseType: !12, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !336, file: !337, line: 252, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !336, file: !337, line: 253, baseType: !341, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !336, file: !337, line: 254, baseType: !341, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !336, file: !337, line: 255, baseType: !341, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !336, file: !337, line: 256, baseType: !341, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !336, file: !337, line: 257, baseType: !341, size: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !336, file: !337, line: 258, baseType: !341, size: 64, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !336, file: !337, line: 259, baseType: !341, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !336, file: !337, line: 261, baseType: !341, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !336, file: !337, line: 262, baseType: !341, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !336, file: !337, line: 263, baseType: !341, size: 64, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !336, file: !337, line: 265, baseType: !354, size: 64, offset: 768)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !337, line: 161, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !336, file: !337, line: 267, baseType: !357, size: 64, offset: 832)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !336, file: !337, line: 269, baseType: !12, size: 32, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !336, file: !337, line: 273, baseType: !12, size: 32, offset: 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !336, file: !337, line: 275, baseType: !361, size: 64, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !362, line: 140, baseType: !363)
!362 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!363 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !336, file: !337, line: 279, baseType: !10, size: 16, offset: 1024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !336, file: !337, line: 280, baseType: !366, size: 8, offset: 1040)
!366 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !336, file: !337, line: 281, baseType: !368, size: 8, offset: 1048)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 8, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 1)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !336, file: !337, line: 285, baseType: !372, size: 64, offset: 1088)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !337, line: 155, baseType: null)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !336, file: !337, line: 294, baseType: !375, size: 64, offset: 1152)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !362, line: 141, baseType: !363)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !336, file: !337, line: 303, baseType: !377, size: 64, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !336, file: !337, line: 304, baseType: !377, size: 64, offset: 1280)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !336, file: !337, line: 305, baseType: !377, size: 64, offset: 1344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !336, file: !337, line: 306, baseType: !377, size: 64, offset: 1408)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !336, file: !337, line: 307, baseType: !382, size: 64, offset: 1472)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !383, line: 62, baseType: !384)
!383 = !DIFile(filename: "/home/libs/flang/bin/../lib64/clang/4.0.1/include/stddef.h", directory: "/home/benchmarks/cpu2017-custom/namd_r/build")
!384 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !336, file: !337, line: 309, baseType: !12, size: 32, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !336, file: !337, line: 311, baseType: !387, size: 160, offset: 1568)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 160, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 20)
!390 = !DISubprogram(name: "zeroresults", linkageName: "_ZN9PatchList11zeroresultsEv", scope: !306, file: !307, line: 35, type: !328, isLocal: false, isDefinition: false, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!391 = !DISubprogram(name: "moveatoms", linkageName: "_ZN9PatchList9moveatomsEv", scope: !306, file: !307, line: 37, type: !328, isLocal: false, isDefinition: false, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!392 = !DISubprogram(name: "setresults", linkageName: "_ZN9PatchList10setresultsEP9ResultSet", scope: !306, file: !307, line: 41, type: !393, isLocal: false, isDefinition: false, scopeLine: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !326, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_class_type, name: "ResultSet", file: !307, line: 14, flags: DIFlagFwdDecl, identifier: "_ZTS9ResultSet")
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pairComputes", scope: !59, file: !60, line: 23, baseType: !398, size: 64, offset: 128, flags: DIFlagPublic)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PairCompute", file: !67, line: 30, size: 384, elements: !400, identifier: "_ZTS11PairCompute")
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !413, !414}
!401 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !399, baseType: !70)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "patchId1", scope: !399, file: !67, line: 36, baseType: !12, size: 32, flags: DIFlagPublic)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "image1", scope: !399, file: !67, line: 37, baseType: !12, size: 32, offset: 32, flags: DIFlagPublic)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "patchId2", scope: !399, file: !67, line: 38, baseType: !12, size: 32, offset: 64, flags: DIFlagPublic)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "image2", scope: !399, file: !67, line: 39, baseType: !12, size: 32, offset: 96, flags: DIFlagPublic)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pairlists", scope: !399, file: !67, line: 41, baseType: !5, size: 128, offset: 128, flags: DIFlagPublic)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pairlistsValid", scope: !399, file: !67, line: 42, baseType: !12, size: 32, offset: 256, flags: DIFlagPublic)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pairlistTolerance", scope: !399, file: !67, line: 43, baseType: !98, size: 64, offset: 320, flags: DIFlagPublic)
!409 = !DISubprogram(name: "PairCompute", scope: !399, file: !67, line: 33, type: !410, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!413 = !DISubprogram(name: "~PairCompute", scope: !399, file: !67, line: 34, type: !410, isLocal: false, isDefinition: false, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!414 = !DISubprogram(name: "doWork", linkageName: "_ZN11PairCompute6doWorkEP9PatchList", scope: !399, file: !67, line: 45, type: !415, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !412, !305}
!417 = !DISubprogram(name: "ComputeList", scope: !59, file: !60, line: 25, type: !418, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!421 = !DISubprogram(name: "~ComputeList", scope: !59, file: !60, line: 26, type: !418, isLocal: false, isDefinition: false, scopeLine: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubprogram(name: "readfile", linkageName: "_ZN11ComputeList8readfileEP8_IO_FILEP9PatchList", scope: !59, file: !60, line: 28, type: !423, isLocal: false, isDefinition: false, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubroutineType(types: !424)
!424 = !{!12, !420, !333, !305}
!425 = !DISubprogram(name: "runComputes", linkageName: "_ZN11ComputeList11runComputesEP9PatchList", scope: !59, file: !60, line: 30, type: !426, isLocal: false, isDefinition: false, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !420, !305}
!428 = !{!429}
!429 = !DILocalVariable(name: "this", arg: 1, scope: !58, type: !430, flags: DIFlagArtificial | DIFlagObjectPointer)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!431 = !DIExpression()
!432 = !DILocation(line: 0, scope: !58)
!433 = !DILocation(line: 16, column: 1, scope: !58)
!434 = !DILocation(line: 13, column: 16, scope: !435)
!435 = distinct !DILexicalBlock(scope: !58, file: !1, line: 11, column: 28)
!436 = distinct !DISubprogram(name: "~ComputeList", linkageName: "_ZN11ComputeListD2Ev", scope: !59, file: !1, line: 18, type: !418, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, unit: !0, declaration: !421, variables: !437)
!437 = !{!438}
!438 = !DILocalVariable(name: "this", arg: 1, scope: !436, type: !430, flags: DIFlagArtificial | DIFlagObjectPointer)
!439 = !DILocation(line: 0, scope: !436)
!440 = !DILocation(line: 19, column: 13, scope: !441)
!441 = distinct !DILexicalBlock(scope: !436, file: !1, line: 18, column: 29)
!442 = !{!443, !447, i64 8}
!443 = !{!"_ZTS11ComputeList", !444, i64 0, !444, i64 4, !447, i64 8, !447, i64 16}
!444 = !{!"int", !445, i64 0}
!445 = !{!"omnipotent char", !446, i64 0}
!446 = !{!"Simple C++ TBAA"}
!447 = !{!"any pointer", !445, i64 0}
!448 = !DILocation(line: 19, column: 3, scope: !441)
!449 = !DILocation(line: 19, column: 3, scope: !450)
!450 = !DILexicalBlockFile(scope: !441, file: !1, discriminator: 1)
!451 = !DILocation(line: 19, column: 3, scope: !452)
!452 = !DILexicalBlockFile(scope: !441, file: !1, discriminator: 2)
!453 = !DILocalVariable(name: "this", arg: 1, scope: !454, type: !65, flags: DIFlagArtificial | DIFlagObjectPointer)
